{
  "project": "GasTownUI",
  "projectPath": "/home/jaden-burton/gt/gastownUIOther",
  "branchName": "ralph/fix-dashboard-visual-bugs",
  "description": "Fix 12 dashboard visual bugs: agent state mismatch, $derived misuse, Canvas double-mount, SSR crash, shared material opacity, stats alias, null safety, lifecycle, z-fighting, frame-rate spawning, and type safety.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Fix agent state type mismatch ('running' vs 'busy')",
      "description": "As a user, I want running agents to appear on their assigned vehicles in the 3D scene so that the visualization accurately represents which agents are working.",
      "acceptanceCriteria": [
        "WarBoyManager.svelte checks for 'running' instead of 'busy' (or +page.svelte maps 'running' to 'busy')",
        "WarBoy.svelte Props interface accepts 'running' in its agentState union type",
        "WarBoy.svelte treats 'running' the same as the current 'busy' behavior (shows arms, no idle sway)",
        "Running agents are positioned on top of their assigned vehicle in the 3D scene, not on the citadel platforms",
        "Idle agents still appear on citadel platforms",
        "Offline agents still render nothing",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Critical: the entire agent-on-vehicle mechanic is broken. AgentStatus is 'running'|'idle'|'offline' but WarBoyManager checks for 'busy'. Files: src/routes/+page.svelte (line 79), src/lib/components/wasteland/WarBoyManager.svelte (line 35), src/lib/components/wasteland/WarBoy.svelte (line 6)."
    },
    {
      "id": "US-002",
      "title": "Fix VehicleConvoy $derived misuse",
      "description": "As a developer, I want groupedTasks to use Svelte 5's $derived.by() so the grouping result is cached instead of recomputed on every access.",
      "acceptanceCriteria": [
        "VehicleConvoy.svelte line 19 changed from $derived(() => { ... }) to $derived.by(() => { ... })",
        "All call sites updated: groupedTasks is now accessed as a value (not called as groupedTasks())",
        "computePosition accesses groupedTasks directly instead of calling it as a function",
        "Vehicle positions still compute correctly for all 5 statuses (pending, running, completed, blocked, failed)",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 2,
      "passes": true,
      "notes": "$derived(() => {...}) wraps the function itself, not the result. groupedTasks is a function reference, not the grouped object. Use $derived.by() for function bodies."
    },
    {
      "id": "US-003",
      "title": "Fix FlameStack $derived misuse",
      "description": "As a developer, I want flameColor to use $derived.by() so the color is cached and Three.js Color objects are not re-allocated on every render.",
      "acceptanceCriteria": [
        "FlameStack.svelte line 31 changed from $derived(() => { ... }) to $derived.by(() => { ... })",
        "Lines 68-69 updated to use flameColor as a value (not flameColor())",
        "Flame color still interpolates correctly between dim and inferno based on intensity prop",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Same $derived misuse pattern as US-002. flameColor is a function, not a color string. Lines 68-69 call flameColor() which re-allocates 3 THREE.Color objects each time."
    },
    {
      "id": "US-004",
      "title": "Fix WastelandHero mountKey causing Canvas double-mount",
      "description": "As a user, I want the 3D scene to mount cleanly without a visible flash or unnecessary WebGL context churn.",
      "acceptanceCriteria": [
        "The $effect that sets mountKey = Date.now() on lines 17-20 of WastelandHero.svelte is removed or replaced with a stable key that does not cause double-mount",
        "Canvas is created exactly once per component mount (no destroy-and-recreate cycle)",
        "3D scene still renders correctly after navigation to and from the dashboard (no black screen regression)",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 4,
      "passes": true,
      "notes": "The previous black-screen fix (US-001 from prior run) introduced a {#key mountKey} block. The mountKey $effect runs on mount, changes the key, destroying and recreating Canvas. Fix: use a stable key (e.g., crypto.randomUUID() called once) or remove the effect and set mountKey directly in the initializer. The {#key} block itself should be kept to handle navigation remount — just stop it from triggering an extra cycle."
    },
    {
      "id": "US-005",
      "title": "Fix SSR crash from window.matchMedia in WastelandHero",
      "description": "As a developer, I want the reduced motion detection to be SSR-safe so the app does not crash during server-side rendering.",
      "acceptanceCriteria": [
        "The $effect on lines 25-33 of WastelandHero.svelte guards against non-browser environments using the browser import from $app/environment",
        "The app builds successfully with vite build (SSR pass does not crash)",
        "Reduced motion preference is still detected correctly in the browser",
        "MediaQueryList listener is still cleaned up on unmount",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 5,
      "passes": true,
      "notes": "$effect blocks run during SSR. The window.matchMedia call on line 26 crashes with 'ReferenceError: window is not defined'. Add: if (!browser) return; at the top of the effect. The browser import is already available in the file from line 3."
    },
    {
      "id": "US-006",
      "title": "Fix VehicleExhaust shared material opacity",
      "description": "As a user, I want exhaust particles to not have a global opacity flicker caused by per-particle opacity overwrites on the shared material.",
      "acceptanceCriteria": [
        "VehicleExhaust.svelte line 113 no longer overwrites the shared material.opacity inside the per-particle loop",
        "Fix: remove the per-particle material.opacity line and keep the material at a fixed opacity (0.6)",
        "Exhaust particles are visible and render without errors",
        "Material cleanup (dispose()) still works correctly on unmount",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 6,
      "passes": true,
      "notes": "All 30 particles share a single PointsMaterial. Line 113 overwrites material.opacity on each loop iteration, so all particles end up with the last particle's opacity. Simplest fix: remove the opacity mutation line entirely."
    },
    {
      "id": "US-007",
      "title": "Fix taskStats.failed aliasing to blocked count",
      "description": "As a developer, I want taskStats.failed to return the actual count of failed tasks, not the blocked count.",
      "acceptanceCriteria": [
        "tasks.svelte.ts stats getter: failed property counts tasks with status === 'failed' (not aliased to blocked)",
        "The stats getter returns correct counts for all 5 statuses: pending, in_progress (running alias), completed, blocked, failed",
        "No other component breaks from this change",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Line 100 has 'failed: blocked' which is wrong — 'failed' is a real TaskStatus. Fix: add a separate filter for status === 'failed'. File: src/lib/stores/tasks.svelte.ts"
    },
    {
      "id": "US-008",
      "title": "Add null check in SparkSystem geometry attribute access",
      "description": "As a developer, I want SparkSystem to safely check for geometry attributes before updating them to avoid runtime crashes.",
      "acceptanceCriteria": [
        "SparkSystem.svelte line 94: add existence check before accessing geometry.attributes.position",
        "Pattern: if (geometry.attributes.position) { geometry.attributes.position.needsUpdate = true; }",
        "No runtime errors when the animation loop fires before geometry is initialized",
        "Spark particles still animate correctly when active",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Race condition: useTask animation loop can fire before the $effect creates the geometry attribute. File: src/lib/components/wasteland/particles/SparkSystem.svelte"
    },
    {
      "id": "US-009",
      "title": "Refactor CitadelGroup SmokeEmitter lifecycle",
      "description": "As a user, I want smoke to not visually jump when load bands change — keep SmokeEmitters always mounted with density prop instead of conditional rendering.",
      "acceptanceCriteria": [
        "CitadelGroup.svelte lines 103-148: SmokeEmitter components are always mounted (not conditionally rendered with {#if})",
        "SmokeEmitter receives a density prop of 0 when its stack is not lit (instead of being destroyed)",
        "When density is 0, SmokeEmitter hides all particles below ground (existing behavior in useTask loop)",
        "No visual jump when smoke toggles on/off",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 9,
      "passes": true,
      "notes": "Currently {#if stackALit} destroys/recreates SmokeEmitter on toggle, causing particle position jumps and memory churn. Move the conditional into the density prop instead."
    },
    {
      "id": "US-010",
      "title": "Fix DesertFloor z-fighting between ground planes",
      "description": "As a user, I want the desert foreground strip to render cleanly without flickering artifacts.",
      "acceptanceCriteria": [
        "DesertFloor.svelte line 13: increase the Y offset of the foreground strip from -0.98 to -0.93 (0.07 unit gap from main ground at -1.0)",
        "Visual appearance of the desert floor is preserved (foreground strip still reads as a distinct lighter area)",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 10,
      "passes": true,
      "notes": "Two overlapping planes at y=-1.0 and y=-0.98 (only 0.02 gap). Increase to 0.07 gap to prevent z-fighting on all GPUs. File: src/lib/components/wasteland/DesertFloor.svelte"
    },
    {
      "id": "US-011",
      "title": "Fix frame-rate dependent particle spawning in VehicleExhaust",
      "description": "As a developer, I want exhaust particle spawn rate to be consistent across different display refresh rates.",
      "acceptanceCriteria": [
        "VehicleExhaust.svelte lines 86-90: replace Math.random() < 0.3 per-frame check with a time-accumulator approach using the delta parameter",
        "Target spawn rate: approximately 5-6 particles per second regardless of frame rate",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 11,
      "passes": true,
      "notes": "Current code: if (Math.random() < 0.3) spawns per frame. At 60fps that's ~18 particles/sec, at 120fps ~36/sec. Fix: add a spawnTimer accumulator, spawn when timer exceeds threshold (e.g., 0.18s). File: src/lib/components/wasteland/VehicleExhaust.svelte"
    },
    {
      "id": "US-012",
      "title": "Remove unsafe 'as any' type assertion in VehicleConvoy",
      "description": "As a developer, I want type safety when passing task status to Vehicle so mismatches are caught at compile time.",
      "acceptanceCriteria": [
        "VehicleConvoy.svelte line 108: remove 'as any' from status and taskType prop assignments",
        "Either narrow the type in VehicleConvoy's Props interface to match Vehicle's expected union, or widen Vehicle's Props to accept string with a fallback",
        "TypeScript catches invalid status values at compile time",
        "Typecheck passes (npx svelte-check)"
      ],
      "priority": 12,
      "passes": true,
      "notes": "Vehicle expects status: 'pending'|'running'|'completed'|'blocked'|'failed' but VehicleConvoy passes task.status (typed as string) with 'as any'. Fix: type the Props tasks array with the correct status union. File: src/lib/components/wasteland/VehicleConvoy.svelte"
    }
  ]
}
